[
    {
        "Date": "December 17, 2024",
        "Version": "0.0.9-rc7",
        "Entries": [
            "Improve readability of space belts / pipes from farther distance",
            "[[Bugfixes]]",
            "Fixed global wire transmitters from older game versions sometimes not working",
            "Fixed 2 layer pipes not rendering gears when empty",
            "Fixed exception when deleting conveyor belts while having the details panel open"
        ]
    },
    {
        "Date": "December 12, 2024",
        "Version": "0.0.9-rc6",
        "Entries": [
            "This is the final, stable release candidate for 0.0.9.",
            "[[Bugfixes]]",
            "Fixed some rare issues with multithreading",
            "Disabled 'Parallel Rendering' setting by default as it causes stuttering for some players."
        ]
    },
    {
        "Date": "December 9, 2024",
        "Version": "0.0.9-rc5",
        "Entries": [
            "[[Balancing]]",
            "Increased platform limit in Hard, Hexagonal and Insane scenario",
            "Increased train vortex delivery research cost",
            "[[Bugfixes]]",
            "Fixed details panel showing wrong building efficiency",
            "Fixed shape previews not showing up correctly",
            "Fixed crystal generator not working at expected speed",
            "Fixed rotators displaying wrong speed",
            "Fixed 'ghost' buildings being created",
            "Fixed excessive memory usage over time",
            "Fixed knowledge panel showing old mixing mechanics for mixers",
            "Fixed various multi-threading related issues",
            "Fixed tutorial not highlighting platforms",
            "Fixed items clipping on space belts",
            "Fixed supporter edition content being available by default",
            "Fixed placement indicators not working correctly for flipped platforms",
            "Fixed error when selecting pumps/extractors on locked tiles",
            "Fixed precision issues in the statistics panel",
            "Fixed unlock screen missing some tooltips",
            "Fixed some issues loading old savegames",
            "Fixed some issues related to selecting buildings",
            "Fixed belt filter using outdated signal values",
            "Fixed belt filter not showing digits correctly on minimal graphics",
            "Fixed various other issues"
        ]
    },
    {
        "Date": "November 26, 2024",
        "Version": "0.0.9-rc3",
        "Entries": [
            "[[Bugfixes]]",
            "Fixed savegames from 0.0.9-rc1 not loading",
            "Fixed visual issue with mirrored mixer",
            "Fixed mirroring 3x2 platforms",
            "Fixed some issues with blueprints, esp. rail blueprints",
            "Fixed trash not working as expected",
            "Fixed missing translation"
        ]
    },
    {
        "Date": "November 22, 2024",
        "Version": "0.0.9-rc2",
        "Entries": [
            "[[Compatibility]]",
            "Savegames below 0.0.8-rc3 (pre-release) are not compatible with this version",
            "Savegames from 0.0.9-rc1 might have some train routing broken, if possible use a backup from 0.0.8 instead",
            "[[Major Changes]]",
            "Speed up saving duration for automatic save by using multiple threads.",
            "[[Bugfixes]]",
            "Fixed various issues introduced by 0.0.9-rc1",
            "Fixed trash not working",
            "Fixed wires keeping signals even when disconnected",
            "Fixed various fluid related buildings not working as expected",
            "Fixed debug.export-game-data not working",
            "Fixed visual issue with wire bridge",
            "Fixed new 1x3 and 2x3 platforms not being available in hard, insane and hex modes",
            "Fixed being unable to delete space belts sometimes",
            "Fixed fluid mixer issues / artifacts",
            "Fixed being able to place belt launchers on locked vortex slots",
            "Fixed wire simulation not behaving as expected",
            "Fixed various visual issues"
        ]
    },
    {
        "Date": "November 11, 2024",
        "Version": "0.0.9-rc1",
        "Entries": [
            "[[General]]",
            "Savegames below 0.0.8-rc3 (pre-release) are not compatible with this version",
            "[[Major Changes]]",
            "Support for multi-threaded simulation (enabled by default) for up to 40x improved simulation performance.",
            "Added end-game shape multiplier upgrade which multiplies all your shape deliveries by up to 6x",
            "Random operator level goals now automatically complete, so you don't need to manually level them up",
            "Added statistics panel, showing shape delivery statistics and structure counts",
            "Fluid miner extensions are now unlocked together with the regular fluid miner already",
            "Reworked space belt visuals - although space pipe visuals remain work in progress",
            "Replaced T-, L- and Cross platforms with 1x3 and 2x3 platforms - old ones will continue to work, but can't be placed anymore.",
            "[[Interface]]",
            "Improved game creation flow to highlight the alternative game modes (hexagonal / hard / insane)",
            "Labels now support special characters, numbers and multiline text.",
            "Added space belts + pipes to the train toolbar",
            "Added hotkey (default 'N') to reset the camera to point North again",
            "Added generic text support (numbers, special characters) to labels - some might not properly work yet though",
            "Added autosave countdown",
            "Improved outdated knowledge panel entries and made train behaviour more clear",
            "Removed 'low graphics quality' warning",
            "[[Other]]",
            "Improved rendering and shader performance, especially for older GPUs",
            "Improved performance when saving game",
            "[[Bugfixes]]",
            "Fixed various simulation precision issues (esp. off-screen)",
            "Fixed random operator level shape generation",
            "Fixed comparison gate not being mirrorable",
            "Fixed blueprint icon being overridden with save-as",
            "Fixed blueprint toolbar configuration not synced via steam cloud",
            "Fixed ability to create infinite paint by mixing tertiary/secondary with primary colors",
            "Fixed various number formatting issues",
            "Fixed performance issues when using trashes as decorations",
            "Fixed Intel Arc(TM) gpus being detected as low-end",
            "Fixed escape sequences breaking blueprint names",
            "Fixed empty markers showing broken tooltips",
            "Fixed rail twisters breaking train line preview",
            "Fixed train (un)loaders not showing progress on lower graphics quality",
            "Lots of other bug fixes and improvements"
        ]
    },
    {
        "Date": "August 19, 2024",
        "Version": "0.0.8",
        "Entries": [
            "[[General]]",
            "Updated Unity version to (hopefully!) resolve various issues with DirectX 12, Wayland and more.",
            "[[Balancing & New Content]]",
            "Added pipe gate",
            "Added virtual pin pusher",
            "[[UI/UX]]",
            "Space belts, pipes & rails now automatically place tunnels while dragging!",
            "Added 'Save As' option as well as 'Replace' for an improved blueprint editing workflow",
            "Added 'Invert Y Axis' option",
            "Added visualizations for trains",
            "Added visualization for map markers in overview mode",
            "Dragging a rail towards the vortex now automatically places a train launcher (once unlocked)",
            "Allow pasting blueprints directly in the library with 'Ctrl + V'",
            "Added setting to control animation quality/fps when zooming out",
            "Properly display conflict indicators for rails if blocked by an adjacent platform",
            "Disable research points 'flashing' reminder for 15 minutes when clicking it",
            "[[Visuals]]",
            "Improved train loader / unloader package icon meshes",
            "[[Localization]]",
            "Improved bent stacker description to mention it's faster than the normal stacker",
            "Fixed inconsistent names between 'Halves Swapper' and 'Swapper' as well as 'Halves Destroyer' vs 'Half Destroyer'",
            "Fixed inconsistent wording for train upgrades",
            "[[Bugfixes]]",
            "Fixed space belts / pipes sometimes not accepting / delivering items at expected throughput",
            "Fixed train unloaders producing a small gap when switching packages",
            "Fluid catcher not transferring fluid to other launcher when the former is on a platform edge",
            "Fixed blueprint toolbar not updating when changing folder contents",
            "Fixed screenshots being stored in wrong folder, now saved in user pictures folder",
            "Fixed some specific space belt loops crashing the game",
            "Fixed blueprints drag-n-drop in library not working when folder list was scrollable",
            "Fixed crash when connecting item producer directly to trash",
            "Fixed research progression statistic showing 100% during tutorial",
            "Fixed overriding blueprints with different case not working as expected",
            "Fixed invalid space pipe throughput display",
            "Fixed rare crash when analytics failed to init",
            "Fixed various pipe/wire path placement issues",
            "Fixed fluid launchers not always displaying throughput / contents"
        ]
    },
    {
        "Date": "July 25, 2024",
        "Version": "0.0.7",
        "Entries": [
            "This is the final release candidate - Please keep reporting bugs and issues though!",
            "[[Changes]]",
            "Rebalanced chunk limit: Space belts now cost only half of regular platforms (balanced the rewards to match)",
            "Rebalanced milestones to give more blueprint points esp. in the later stages",
            "Added last remaining LODs for better performance",
            "Updated soundtrack",
            "Updated menu savegame and added separate one for the supporter edition",
            "[[Bugfixes]]",
            "Fixed space belt animations pausing when looking from specific camera angles",
            "Fixed rail ends missing in certain situations",
            "Fixed belt lift colliders being too small, making them hard to click",
            "Fixed inconsistent space belt placement behaviour"
        ]
    },
    {
        "Date": "July 24, 2024",
        "Version": "0.0.6",
        "Entries": [
            "This is almost the final release candidate - Please report any issues you find and be extra picky!",
            "This update fixes the issues introduced by 0.0.5",
            "[[Balancing]]",
            "Rebalanced (lowered) costs of train related platforms",
            "Improved initial resources in hexagonal mode to avoid having not enough resources",
            "[[Visuals]]",
            "Improved wagon / locomotive visuals",
            "Added LODs for remaining content, for improved performance",
            "[[Bugfixes]]",
            "Fixed items going in wrong directions in the space belt/pipe visualization",
            "Fixed blueprint icons not being draggable",
            "Fixed research tree not focusing on current milestone",
            "Fixed button on/off text rendering through other buildings",
            "Fixed z-fighting on launcher/catcher stands",
            "Fixed various issues in the translations",
            "Fixed crystal shader looking inconsistent",
            "Fixed train loaders / unloaders hiding shapes when disabling layer visibility"
        ]
    },
    {
        "Date": "July 23, 2024",
        "Version": "0.0.5",
        "Entries": [
            "This is almost the final release candidate - Please report any issues you find and be extra picky!",
            "[[Savegame Compatibility]]",
            "Savegames from 0.0.1 and above are compatible and will stay compatible in the future.",
            "[[Development]]",
            "Vastly improved 'overview' mode performance esp. when zooming out far",
            "Vastly improved prediction performance (still no fluids)",
            "[[Visuals]]",
            "New visuals for overview mode, making it easier to inspect factories and train lines",
            "Improved space belt/pipe item visualization by fading in/out items",
            "Improved train visuals to make them easier to see",
            "Added LODs for almost all remaining content",
            "Updated crystal mesh in hexagonal mode",
            "Added 4 new arrow blueprint icons",
            "[[Bugfixes]]",
            "Fixed crystal generator showing wrong throughput",
            "Fixed space pipes showing too low throughput",
            "Fixed dragging belt over inverse direction belt placing unnecessary splitters/mergers",
            "Fixed research points blinking even with no research available",
            "Fixed belt launchers not having stands",
            "Fixed belt reader texture",
            "Fixed trains clipping into platforms",
            "Fixed dragging rail beside train spawner making it disappear",
            "Fixed train line visualization disappearing after twisters / loops",
            "Fixed trains clipping into each other",
            "Fixed space belt/pipe placement not allowing all rotations during placement",
            "Various smaller fixes"
        ]
    },
    {
        "Date": "July 22, 2024",
        "Version": "0.0.4",
        "Entries": [
            "This is almost the final release candidate - Please report any issues you find and be extra picky!",
            "This update attempts to fix the space belts throughput issues with launchers. If you still run into any issues, please report them!",
            "[[Savegame Compatibility]]",
            "Savegames from 0.0.1 and above are compatible and will stay compatible in the future.",
            "[[Balancing & New Content]]",
            "There is now a second random operator level goal, which involves crystals (if you want a really tough challenge)",
            "New visualization for space belts & pipes that shows the items on belts! (We'll continue to improve it at a later stage)",
            "[[Known Issues]]",
            "Predictions were disabled for most fluid related buildings, so they won't work there (until we fix the performance)",
            "[[Interface]]",
            "Space belts & pipes now properly show content i.e. 180/m x 12",
            "Buildings like the full cutter or halves swapper now show throughput as '45/m x 2' to indicate it is per input/output lane",
            "Improved rail colors visualization",
            "Now also displaying pump / launcher throughput in speed upgrades",
            "Updated translations",
            "Pinned shapes are now hidden during blueprint placements to avoid clicking them by accident",
            "Added sound when upgrading operator level",
            "[[Bugfixes]]",
            "Maybe fixed a bug where launchers could end up in an invalid state, leading to stalled/inefficient space belts. If you still encounter the issue, please report it!",
            "Fixed global wire transmitter / receiver states being so global that they even persisted between savegames",
            "Fixed various issues with operator levels in the hexagonal mode progression",
            "Fixed blueprint folders not automatically selecting first item",
            "Fixed pending selection not being properly cleared, leading to more buildings/platforms deleted than intended",
            "Fixed notification dot not going away when unlocking new tasks",
            "Fixed blueprint toolbar being overlapped by hotkey hints (now it overlaps the hints instead for now)",
            "Fixed belt port placement removing belts in the wrong direction",
            "Fixed compass not properly updating angle when zooming out",
            "Fixed various issues in non-english languages like text being cut-off or hidden",
            "Fixed same music tracks playing over and over",
            "Fixed clicking buildings in the selection panel to deselect only the buildings working not as expected",
            "Fixed sounds still playing while not focused",
            "Fixed invalid characters being allowed for blueprint names",
            "Fixed keybindings not counting when opening the research screen for the tutorial"
        ]
    },
    {
        "Date": "July 19, 2024",
        "Version": "0.0.3",
        "Entries": [
            "This is almost the final release candidate - Please report any issues you find and be extra picky!",
            "This update fixes most of the issues introduced in 0.0.2, but unfortunately you will have to re-place your train stations & spawners.",
            "[[Savegame Compatibility]]",
            "Savegames from 0.0.1 and above are compatible and will stay compatible in the future.",
            "[[Known Issues]]",
            "Predictions were disabled for most fluid related buildings, so they won't work there (until we fix the performance)",
            "[[Balancing & New Content]]",
            "Trains now wait much less on train stations and are also loaded much faster, to avoid throughput issues",
            "[[Visuals]]",
            "Added & fine tuned animations for launchers <-> train stations",
            "[[Development]]",
            "Vastly improved performance for save games with many space belts / pipes / rails",
            "[[Bugfixes]]",
            "Fixed shape predictions causing huge lag (some features were now disabled until we fix the performance)",
            "Fixed train unloaders not being able to deliver to train loaders",
            "Fixed auto-rotation for launchers/catchers on notches not working as expected",
            "Fixed switching variants or jumping to the vortex causing long space belts / rails to the vortex.",
            "Fixed mirrored loaders/unloaders flipping cargo",
            "Fixed excessive analytics log statements",
            "Fixed trains slowing down too much when waiting for other train to leave station",
            "Fixed space belt placement auto-snapping not behaving as expected",
            "Fixed clear contents on train unloaders not fully clearing the unloader",
            "Fixed trains being spawned even when no wagons were added, causing visual artifacts",
            "Fixed being unable to paste train stops",
            "Fixed research showing as 100% even when one node was still not completed",
            "Fixed logfile spam with invalid blueprint icons",
            "Fixed exception / glitch when placing a checkpoint on the first tile of a space belt / pipe"
        ]
    },
    {
        "Date": "July 18, 2024",
        "Version": "0.0.2",
        "Entries": [
            "This is almost the final release candidate - Please report any issues you find and be extra picky!",
            "[[Savegame Compatibility]]",
            "Savegames from 0.0.1 are compatible.",
            "[[Known Issues]]",
            "Around 15% of the (non-English) translations are not yet translated and will display in English.",
            "Predictions may still break in larger networks, please report any issues!",
            "[[Balancing & New Content]]",
            "The stacker has been changed to be 'straight' again (6 per belt). The 'bent' stacker (4 per belt) is an upgrade in the shop now and allows for more compact layouts still.",
            "'No Straight Stacker' game rule has been added and is by default active on new 'Insane Mode' scenarios.",
            "Operator level rewards have been greatly improved (up to 500%)",
            "Added knowledge panel entries for Operator Level, Wires, Vortex Delivery Indicators",
            "Added more content to existing knowledge panel entries",
            "Updated all images & videos in the game",
            "Added chinese / japanese translations",
            "[[Visuals]]",
            "Added visuals for connections between train wagons & locomotives",
            "Added various animations for items, i.e. between train loaders / unloaders",
            "Improved LOD logic for buildings, causing factories to look better when zoomed out far",
            "Added new visuals for rotator platform in hexagonal mode to indicate 60 degree rotation",
            "Added LOD meshes for miners, wires and more, should lead to big performance gains",
            "Improved belt launcher animation",
            "[[Development]]",
            "Lots of performance improvements for simulation & rendering",
            "Lots of performance improvements for blueprint placement, up to 50x",
            "[[User Interface]]",
            "Vastly improved belt launcher / catcher placement, now draggable & many improvements!",
            "Vastly improved space belt/pipe tunnel placement!",
            "Pipe & wire launchers / transmitter now also use the same placement (and improvements) as belt launchers",
            "Improved space belt / pipe placement, now auto-connects to extractors, tunnels & train loaders / unloaders",
            "Allow clicking research points to open shop",
            "Added 'locked' vortex delivery indicator for goals that are not unlocked yet.",
            "Creating a blueprint now offsets it so it stays at the same location until you move your cursor.",
            "Improved display of milestones in research tree",
            "Added auto-connection during placement functionality to pipe / wire buildings",
            "Added new logo for supporter edition in main menu",
            "Added (temporary) new menu savegame",
            "Allow deleting checkpoints for space paths / trains by using 'C' again while hovering them",
            "[[Bugfixes]]",
            "Fixed blueprint toolbar not being saved",
            "Fixed mixer not working at advertised speed",
            "Fixed shapes clipping on splitters",
            "Fixed shape asteroids around vortex platform still having soot from previous operators",
            "Fixed shape predictions not working as expected, esp. for fluid related buildings",
            "Fixed train not leaving station after replacing colored splitter",
            "Fixed multiple issues in the hexagonal / insane scenario",
            "Fixed painters & pipes showing fluid predictions (was not intended)",
            "Fixed being unable to clear pipes",
            "Fixed wire display not displaying color when zooming out",
            "Fixed trains launching into hub working even without upgrade unlocked",
            "Fixed space belts / pipes 'eating' items",
            "Fixed mirrored painter roll spinning in wrong direction",
            "Fixed using map markers far from vortex causing camera to get stuck ",
            "Fixed 'show folder' showing explorer in background",
            "Fixed waypoints not working as expected in hexagonal mode & spamming logfile",
            "Fixed mixer not rendering contents on minimum graphics",
            "Fixed old blueprints causing the game to flicker",
            "Fixed ESC not working when blueprint toolbar is selected",
            "Fixed train loaders / unloaders 'stuttering' during loading when viewed from far away",
            "Fixed localized fonts not being used, causing glyphs to render bold / weird when they shouldn't",
            "Fixed various issues with the belt placement regarding to notches",
            "Fixed pipetting fluid launchers not giving fluid launchers but pipes",
            "Fixed tutorial hints showing while paused",
            "Fixed various issues with the belt launcher / catcher placement",
            "Fixed wire related buildings auto-rotation not working as expected",
            "Fixed platform cost not being shown during space belt / pipe placement",
            "Fixed pause menu asking for confirm to leave even if game was saved shortly before",
            "Fixed mixer / fluid tank not showing fluids anymore when zooming out even just a bit",
            "Fixed invalid tooltip for 'scenario' during game creation",
            "Fixed pipes showing wrong throughput",
            "Fixed floating trains when deleting twisters / loops",
            "Fixed trains not despawning when wagons would float in space",
            "Fixed blueprint details showing splitters/mergers as individual entries, now grouped as 'belt'",
            "Fixed mixer rendering",
            "Fixed rotator not visually rotating",
            "Fixed first 7 side tasks automatically completing when transferring to next scenario"
        ]
    },
    {
        "Date": "July 11, 2024",
        "Version": "0.0.1",
        "Entries": [
            "This is the first beta! Savegames will not break anymore, and this version is basically final, with only minor tweaks and bug fixes coming.",
            "[[Savegame Compatibility]]",
            "Savegames from alpha 23 and 23.1 and 23.2 are compatible.",
            "[[Balancing & New Content]]",
            "Added remaining hexagonal mode goals",
            "[[Visuals]]",
            "Updated train wagon visuals",
            "Added animations for launchers <-> train stations",
            "Added animations for trains being delivered into the vortex",
            "[[User Interface]]",
            "Added default keyboard shortcuts for camera up / down to better support steam deck layouts",
            "Use 45 degree keyboard snapping for steam deck by default to ease camera navigation",
            "[[Bugfixes]]",
            "Fixed upgrading belts throwing exception",
            "Fixed KeyNotFoundException when deleting launchers / catchers",
            "Fixed savegames from alpha 23/23.1 not properly loading",
            "Fixed StackOverflowException when placing large blueprints",
            "Fixed mixer / fluid storage fluid disappearing too early when zooming out",
            "Fixed trains not properly slowing down before train stations",
            "Fixed non-implemented visualizations being disabled",
            "Fixed (some) precision issues when building more than 32,767 tiles (~1600 chunks / 25 sectors) from the hub",
            "Fixed train unloader not accepting items when it was partially full",
            "Fixed pipes showing wrong throughput",
            "Fixed being unable to merge rail into other rail if the next tile is empty",
            "Fixed fluids in fluid packages disappearing when zooming out",
            "Fixed 'Assertion Failed' when deleting pipes",
            "Fixed obvious stuttering in item movement / train loader animations when zooming out",
            "Fixed wagon extensions incorrectly connecting to locomotives",
            "Fixed various issues in the 'insane' scenario",
            "Fixed global wire transmission being unlockable without 3rd floor unlocked"
        ]
    },
    {
        "Date": "July 10, 2024",
        "Version": "0.0.0-alpha23.2",
        "Entries": [
            "[[Savegame Compatibility]]",
            "Savegames from alpha 23 and 23.1 are compatible, but all items / wire configuration will be cleared upon loading (sorry!)",
            "[[Visuals]]",
            "Fine tuned fluid shaders",
            "New train locomotive visuals",
            "[[User Interface]]",
            "You can now see your operator level ranking, compared to other players!",
            "Added animations for belt launchers / fluid launchers towards space belts / pipes",
            "Added configurable hotkey for previous / next toolbar slot (default '=' and '-')",
            "Improved display of 'unlock' button to be more readable",
            "Added auto-rotation during placement for wire buildings",
            "[[Development]]",
            "Various performance improvements",
            "[[Localization]]",
            "Added portuguese and japanese translations",
            "[[Other]]",
            "Added new soundtrack (wip)",
            "Auto select 'medium' graphics quality on steam deck",
            ".spz2 files in the 'savegames/' folder will now be automatically imported upon launch",
            "[[Bugfixes]]",
            "Fixed shapes on belts 'jumping' while building",
            "Fixed train vortex delivery not working",
            "Fixed exception when selecting connected wires / belt catchers",
            "Fixed buildings not showing throughput anymore",
            "Fixed outdated blueprints causing exceptions",
            "Fixed belt filters working at lower speed than expected, especially out of view",
            "Fixed hotkeys not being updated when the keyboard layout is changed during gameplay",
            "Fixed pumps not being replaceable by other pumps without shift",
            "Fixed korean line breaking options",
            "Fixed various goals in the insane scenario",
            "Fixed miner extensions causing Exception when connected to two different shape patches",
            "Fixed rails replacing train loaders / unloaders",
            "Fixed 'cannot safely divide' error when loading savegame",
            "Fixed exception when delivering more than int32.MaxValue of a shape to the vortex",
            "Fixed exception when clearing space belts / pipes",
            "Fixed being able to place pipe/wire launchers on the vortex",
            "Fixed blueprints with item producers / constant signals causing exceptions in hex vs default mode",
            "Fixed shapes being culled very early in minimal mode",
            "Fixed IndexOutOfRangeException while placing rails",
            "Fixed map generation showing only one entry",
            "Fixed old blueprints not properly pasting",
            "Fixed 'buffer is full, allocate more capacity' exception on space paths",
            "Fixed --reset-all-prefs flag not working",
            "Fixed items not being properly loaded, causing buildings to empty on load",
            "Fixed space belts causing gaps on belts when loading",
            "Fixed settings help texts not displayed in console",
            "Fixed invalid blueprint dimensions being displayed",
            "Fixed virtual halves swapper having unnecessary mirrored variant"
        ]
    },
    {
        "Date": "July 6, 2024",
        "Version": "0.0.0-alpha23.1",
        "Entries": [
            "[[Savegame Compatibility]]",
            "Savegames from alpha 23 are compatible",
            "[[User Interface]]",
            "Mirroring blueprints now respects the camera orientation and thus will always flip vertical by default.",
            "[[Bugfixes]]",
            "Fixed floor disappearing when placing trashes",
            "Fixed exception when saving after clearing space belts / pipes / tunnels",
            "Fixed game stopping animation when selecting 'High UPS'",
            "Fixed exception when copying / pasting blueprints with invalid buildings",
            "Fixed invalid halves swapper mirroring behaviour",
            "Fixed 180 rotator not properly rotating in hexagonal mode",
            "Fixed item producer not working in hexagonal mode",
            "Fixed belt/pipe end meshes not rendering",
            "Fixed changing language resetting dropdown settings"
        ]
    },
    {
        "Date": "July 5, 2024",
        "Version": "0.0.0-alpha23",
        "Entries": [
            "[[Savegame Compatibility]]",
            "Savegames from alpha 22.4 and below are NOT compatible due to major feature changes",
            "[[Known issues]]",
            "Mirrored versions of train loader / unloader show arrow indicators in the wrong direction",
            "Blueprint icons don't properly work in the hexagonal scenario",
            "[[Balancing & New Content]]",
            "Hexagonal shapes & scenario!",
            "Translations for almost all languages have been added! Please report issues via Feedback > Report Translation Issue!",
            "Train loaders now deduct mismatching shapes from existing packages, so if you switch to a different shape they will eventually clear the current package and start the correct new one.",
            "Added virtual halves swapper",
            "Allow reading random operator shapes via global wire receiver",
            "Rebalanced fluid buildings to be more intuitive, added more information in panels",
            "Added upgrade for train speed & capacity",
            "The ability to launch trains into the vortex is now an upgrade",
            "Supplying a different fluid to buildings (i.e. painter) now makes them slowly drain and then eventually consume the new fluid",
            "[[Visuals & Graphics]]",
            "New miner visuals (Shape Miner + Extension, Fluid Miner + Extension)",
            "New train loader / unloader and wagon visuals! (Some parts still need adjustments)",
            "New animation for items going into the Vortex",
            "Fixed belt launcher / catcher animations (still broken towards space belts)",
            "Improved trash animation & blueprint mesh",
            "Replaced obvious placeholder counter on locomotives",
            "Added basic mixer animation",
            "Added rail loop visuals (requires 'Enable all DLCs' in dev settings)",
            "[[Development]]",
            "Lots of rendering & blueprint performance improvements",
            "Lots of simulation performance improvements",
            "Placing blueprints / large islands should now be much faster",
            "Vastly improved savegame loading time",
            "Fixed almost all precision errors on low UPS (painters still have minor ones)",
            "Added adaptive UPS based on camera distance to further improve performance",
            "Fixed various issues in the wire logic (ported from wiretest1)",
            "[[User Interface]]",
            "Improved rail placement",
            "Added new shapes for the operator level icon",
            "Moved painter & crystal generator origin to the conveyor belt instead of tank (breaks old blueprints)",
            "Allow clearing platform (including space belt/pipe and train loader/unloader) contents",
            "Fixed & streamlined various translations",
            "Improved 'feedback' dialog and added link to report translation issues",
            "Add badge in menu for supporter edition",
            "Added (wip) placement helpers to more platforms to show inputs / outputs",
            "[[Bugfixes]]",
            "Fixed buildings not working anymore after selecting them",
            "Fixed painting speed upgrade not working as expected",
            "Fixed error when placing space belts / pipes",
            "Fixed undo/redo not always working",
            "Fixed building titles being cut off in details panel",
            "Fixed pumps not showing throughput",
            "Fixed space belts / pipes not properly scaling - now scales 1:1 with belt speed",
            "Fixed belt reader number rendering",
            "Fixed research tree scroll direction being inverted",
            "Fixed space pipes and belts being able to be connected to each other",
            "Fixed clicking on empty space not deselecting selection when more than one building is selected",
            "Fixed blueprints with icons not being properly copied to the clipboard",
            "Fixed bug that would cause infinite fluid supply",
            "Fixed various bugs when mirroring specific buildings or 2x2 platforms",
            "Fixed various issues with trains being loaded / unloaded",
            "Fixed setting player level not counting as cheat",
            "Fixed sandbox item producer showing wrong throughput",
            "Fixed space belts / pipes showing extra frame mesh during placement",
            "Fixed 'Arithmetic operation resulted in an overflow' exception when using belt readers",
            "Fixed various bugs related to the color mixer",
            "Fixed fluid launchers / catchers not working as expected in some situations",
            "Fixed 'mirror' option being shown for platforms that don't make sense to mirror",
            "Fixed exception when deleting outdated savegame",
            "Fixed locked blueprint shapes showing empty tooltip",
            "Fixed research points reminder showing even if nothing can be purchased",
            "Fixed 'InvalidOperationException' when switching scenarios",
            "Fixed pause indicator overlapping research UI",
            "Fixed fluid miner supporting incorrect number of extensions",
            "Fixed 'Material ID exceeded range' exception",
            "Fixed pumps not properly rendering",
            "Fixed missing pins in hard mode progression shapes",
            "Fixed predictions not working when space belts / pipes are between",
            "Fixed predictions not working for fluid buildings (painter / crystal generator)",
            "Fixed various bugs with (mirrored) train loaders / unloaders not working as expected",
            "Fixed vortex input upgrade showing 14 upgrades when only 12 are possible"
        ]
    },
    {
        "Date": "June 21, 2024",
        "Version": "0.0.0-alpha22.4",
        "Entries": [
            "[[Savegame Compatibility]]",
            "Savegames from alpha 22.3 are compatible.",
            "[[Development]]",
            "Low UPS: Factories not in view are now simulated at lower tick rates for up to 20x simulation performance improvements. Please report any issues!",
            "[[User Interface]]",
            "Improved space belt & pipe placement, now should behave similar to belts (more improvements coming)",
            "Removed confirmation when purchasing speed upgrades",
            "[[Bugfixes]]",
            "Fixed merging space belts causing an exception",
            "Fixed 'negative train velocity' errors",
            "Fixed belt catchers becoming stuck coming off space belts",
            "Fixed error / invisible painters when deleting painters / fluid pipes",
            "Fixed 'not enough space to place item on lane' error with space pipes",
            "Fixed exception when deleting islands containing painters",
            "Fixed console errors when clicking on conveyor or pipe to place",
            "Fixed mismatching throughput in fluid launchers / space pipes",
            "Fixed 'Relaxed' difficulty being selected as the default",
            "Fixed random number generation not working as expected",
            "Fixed various translation errors",
            "Fixed empty tooltip displayed for locked blueprint shapes"
        ]
    },
    {
        "Date": "June 18, 2024",
        "Version": "0.0.0-alpha22.3",
        "Entries": [
            "[[Savegame Compatibility]]",
            "Savegames from alpha 22.2 (unreleased), alpha 21.1 and below are NOT compatible due to major feature changes",
            "[[Known Issues]]",
            "Some visuals may look very work in progress or missing entirely, especially belt / fluid launcher animations.",
            "[[Balancing & New Content]]",
            "Added 'Hard' and 'Insane' difficulties with entirely new shape progressions!",
            "Operator Level: Keep delivering old shapes to increase your operator level, granting you chunk limit, research points & blueprint currency! Unlocks together with fluids.",
            "Added tutorial for all milestones & mechanics",
            "Reworked all knowledge panel entries, added videos and added missing information (let us know if something is missing!)",
            "Updated most preview images and videos for the research  / upgrades tab",
            "Cleaned up all building, research & platform names and descriptions",
            "Allow mirroring space platforms",
            "Allow setting custom icons for blueprints, based on shapes & predefined icons!",
            "[[Visuals & Graphics]]",
            "Updated train & rail visuals! More visual updates are planned for the next update, not all of them are done yet (i.e. loaders, unloaders, wagons, ...).",
            "[[Development]]",
            "Various performance & rendering improvements",
            "Huge internal simulation refactoring. Please report any issues / suspicious behaviour!",
            "Switched to DirectX 11 as the default rendering backend on windows",
            "[[User Interface]]",
            "Cleaned up train toolbar & icons",
            "Added new visualization that shows conflicts (i.e. disconnected outputs)",
            "Merged Upgrades and Shop into one shared 'Upgrades' Tab",
            "Allow clearing fluid buildings via the 'Clear Contents' option",
            "Added setting to disable chromatic aberration / vignette",
            "Added setting to choose the target display",
            "Added setting to disable input latency and disable it by default",
            "Disabled auto-rotation during placement for large buildings like the painter, etc.",
            "Allow disabling custom cursor",
            "Automatically place 'splitters' / 'mergers' for wires & pipes and remove them when they are no longer needed",
            "Added glow indicator for shapes that are actively delivered",
            "Improved difficulty & scenario selection screen",
            "Improved placement logic, do not require 'Shift' to replace conveyor belts / transport structures",
            "Fixed unlock notifications having unnecessary timer",
            "Transitions between waypoints or moving to the vortex are now animated",
            "Don't draw pending placement on invalid places, i.e. if 'over-dragging' a belt towards the hub",
            "Added placement indicators for fluid & wire buildings to better show inputs / outputs",
            "Improved fluid miner placement indicators",
            "Updated game logo",
            "Allow directly going to the knowledge panel entry while placing a building / selecting it",
            "Updates to the wire building icons",
            "Improved & fixed belt launcher placement indicators & logic",
            "Selecting a blueprint is no longer an undo/redo able action, instead it goes in parallel",
            "Added setting to control toolbar selection mode (deselect / cycle) and make 'deselect' the default (was cycle before)",
            "Lots of UI polishing & bugfixes",
            "[[Bugfixes]]",
            "Fixed vortex inputs being locked after reloading a savegame",
            "Fixed FPS limit not working with VSYNC enabled",
            "Fixed undo/redo not working as expected",
            "Fixed 'Mesh id exceeded range' exception",
            "Fixed exception when changing settings",
            "Fixed item producer / constant signal allowing shapes with different part counts",
            "Fixed fluid miner extension being unlocked before unlocking it in the shop",
            "Fixed rotation not saved when pipetting a building",
            "Fixed active visualizations not being saved",
            "Fixed empty savegame being named '???' when deleting",
            "Fixed platform limit not being disabled with 0% multiplier",
            "Fixed waypoints being available via hotkey before unlocking",
            "Fixed research tooltips showing '[unassigned]'",
            "Fixed various number formatting issues",
            "Fixed invalid blueprint library sorting",
            "Fixed default export filename containing '.spz2' twice",
            "Fixed wire crossing not working as expected and keeping old values / breaking other circuits",
            "Fixed trash not being able to be placed next to the border",
            "Fixed level of details not working as expected in various places, leading to performance drops",
            "Fixed undo on german keyboards not being mapped to Ctrl + Z",
            "Fixed shape displays disappearing on the screen edges",
            "Fixed shape amount 'jumping' due to no monospace font",
            "Fixed font rendering for non-english languages, i.e. Thai"
        ]
    },
    {
        "Date": "May 26, 2024",
        "Version": "0.0.0-alpha21.1",
        "Entries": [
            "Fixed research not unlockable in challenge mode",
            "Fixed map preview zoom being inverted",
            "Fixed old savegames not being marked as invalid"
        ]
    },
    {
        "Date": "May 25, 2024",
        "Version": "0.0.0-alpha21",
        "Entries": [
            "[[Savegame Compatibility]]",
            "Savegames from alpha 20 and below are NOT compatible due to major feature changes",
            "[[Balancing & New Content]]",
            "<b>Game Customization</b>! Customize map, seed, scenario, difficulty & more!",
            "<b>Entirely Reworked Progression</b>: Milestones are now progressive, over 200 new shapes, everything rebalanced",
            "<b>Content modding</b>: The game now supports custom scenarios! Instructions follow in a future post.",
            "<b>Hexagonal Shapes PoC</b>: Proof of concept for a hexagonal shapes mode!",
            "<b>Blueprint History</b>: You can now cycle previous blueprints with Ctrl + Mouse Wheel",
            "<b>Mirrored Buildings</b>: All buildings can now be mirrored!",
            "Big upgrades like trains/wires have been split in one milestone + smaller upgrades in the shop",
            "Blueprints are now free in the default difficulty, and only cost points in the 'Challenge' difficulty",
            "Removed blueprint discount upgrade",
            "Added 2 (nonfunctional) speed upgrades for trains",
            "Added space pipe tunnels",
            "You can now select music packs",
            "Trash can now be placed next to the border",
            "Added virtual crystal generator",
            "Re-added very basic tutorial again (WIP!)",
            "[[Visuals & Graphics]]",
            "Switched to DirectX 12 on Windows. Please report any issues!",
            "Fixed lots of visual issues / clipping with blueprints",
            "Various improvements to various meshes",
            "Lots of fixes for pipes, especially 2-layer pipes",
            "Started to work on train / rail visuals, but not yet finished -> WIP!",
            "Re-added animation to shape miners",
            "Space belts now have LOD meshes, making them much faster to render",
            "Improved ",
            "[[Development]]",
            "Prepared steam SDK",
            "Improved serialization robustness",
            "Lots of performance improvements, esp. for space belts",
            "Map generation improvements",
            "[[User Interface]]",
            "Reworked research UI",
            "Allow customizing game in menu, allow previewing & customizing map generation",
            "Allow assigning keys to specific research tabs",
            "Added chinese version of the logo",
            "Improved shape viewer usability",
            "Added custom cursor",
            "Added option to configure savegame name during creation",
            "Added feedback button in menu & game",
            "Improved display of fluids in building details and also show minimum amount (i.e. for painter)",
            "Added placement indicators for labels",
            "Started to fine tune some toolbar icons",
            "Shape cost displays now indicate whether the shape is actively delivered",
            "Added warning on low/ultra low graphics quality",
            "Added option to re-configure savegame difficulty after creation",
            "Added translations for other languages again (WIP)",
            "When clicking a pinned task the upgrade is now highlighted",
            "Added hotkey hints above toolbar to show common hotkeys",
            "Main menu now shows news",
            "Main menu now shows recommended content if there is at least one savegame",
            "Show reminder when having unspend research points",
            "[[Bugfixes]]",
            "Fixed blueprints not copying configuration (i.e. label text)",
            "Fixed menu button keeping hovered state when disabled",
            "Fixed same music track looping over and over",
            "Fixed crystals also sticking to non-crystals",
            "Fixed constant signal / display color display",
            "Fixed a lot of artifacts with the trash",
            "Fixed clicking a pinned task not going to the actual upgrade",
            "Fixed belt catapult placement (more to come)",
            "Fixed speed-up not counting as cheat",
            "Fixed mouse wheel not disabled over dropdowns",
            "Fixed belt lifts not properly rotating shapes on paddles",
            "Fixed import / open folder buttons in menu swapped",
            "Fixed exceptions on cutter / half destroyers related to crystals",
            "Fixed almost all train bugs",
            "Fixed blueprinting lifts/pipes going one layer up",
            "Fixed label not updating text",
            "Fixed blueprint cost generation",
            "Lots of other fixes!"
        ]
    },
    {
        "Date": "May 2, 2024",
        "Version": "0.0.0-alpha20",
        "Entries": [
            "[[Savegame Compatibility]]",
            "Savegames from alpha 19 and below are NOT compatible due to major feature changes",
            "[[Balancing & New Content]]",
            "New platform: Train twister - Allows to swap top and bottom track",
            "Vastly increased fluid storage throughput",
            "More interesting map generation - farther from the HUB now colored and pure shapes can spawn. Also patches are much bigger.",
            "Increased pipe launcher throughput by 50%",
            "Trains now avoid collisions with other trains",
            "Topmost pins now count for research and are no longer ignored",
            "Added wire crossing mesh",
            "Added global wire transmitter + receiver",
            "Added 2 layer pipes",
            "Added more milestones",
            "[[Visuals & Graphics]]",
            "Entirely new space belt visuals",
            "Finalized stacker visuals",
            "Finalized pipe visuals",
            "New blueprint, placement & selection shaders for buildings",
            "Added different input vs output mesh for wire buildings",
            "You can now select a different color scheme (RGB, RYB, CMYK, RGB - High Contrast & Color Blind) in the settings. It can be changed anytime.",
            "Added placement indicators when placing fluid miners & pumps",
            "Fine-tuned pin shader to be more visible on top of shapes (which is now important, see above)",
            "Trash no longer renders conflict indicators to avoid visual noise",
            "[[Development]]",
            "Refactored the simulation, it should be more precise now",
            "Space belts should be almost fully precise now",
            "Various performance improvements (more to come)",
            "[[User Interface]]",
            "Unlocking a milestone now shows an overview over the new tasks, upgrades and unlocks you got.",
            "You can now click the info icon on a milestone to see the unlock notification again, also for future milestones.",
            "Allow changing language without restarting the game, no effect since other languages are disabled during the alpha",
            "Added 'neutral' rail that allows placing rails without selecting a specific color (WIP)",
            "Lots of minor HUD/QoL improvements",
            "Fixed preloader not being fully localized",
            "Reworked main UI to have one button per research category, also showing when new unlocks are available",
            "Improved upgrades UI to better show changes in speeds",
            "[[Bugfixes]]",
            "Fixed HUB vertex outline error",
            "Fixed trash making playingfield disappear",
            "Fixed space belts not saving items",
            "Fixed buildings being replaced during belt placement without holding shift",
            "Fixed multiple train related issues",
            "Fixed multiple string formatting issues",
            "Fixed game freezing when losing focus on macOS",
            "Fixed game crashing on exit",
            "Fixed F2 not hiding UI",
            "Fixed fluid asteroids casting / receiving shadows",
            "Fixed multiple crystals & half cutter related issues",
            "Fixed blueprints quickstart game rule not giving blueprint points (now gives 10k)",
            "Fixed shape producer allowing empty shapes",
            "Fixed constant signal producer not keeping previous value in input field",
            "Fixed wire crossing not glowing / showing wire value",
            "Fixed AND gate not showing network info",
            "Fixed error dialog when renaming blueprint folder",
            "Fixed invalid overview mode coordinate generation / overlap",
            "Fixed overview mode sector display being misaligned",
            "Fixed error when selecting locked slot in toolbar",
            "Fixed rotating space belts / rail blueprints",
            "Fixed speed upgrades being unlocked twice or more when clicking 'confirm' button fast",
            "Fixed speed upgrades unlock causing an exception",
            "Fixed multiple simulation precision issues (but by far not all)",
            "Fixed 3-way splitter not distributing evenly",
            "Fixed low UPS mode not working as expected"
        ]
    },
    {
        "Date": "April 12, 2024",
        "Version": "0.0.0-alpha19",
        "Entries": [
            "[[Savegame Compatibility]]",
            "Savegames from alpha 18 and below are NOT compatible due to major feature changes",
            "[[Major Gameplay Changes]]",
            "Entirely reworked Trains! Watch the video on discord for more information.",
            "Removed Shape & Fluid packing from the game, it now happens on the train stations automatically.",
            "Fluids can now be catapulted between islands with fluid launchers.",
            "Added Space Pipes to transport fluid over mid-range distances. (Work in progress - no pipe tunnels yet)",
            "You can now bind Blueprints & Blueprint Folders to the toolbar (Configuration not permanently saved yet)",
            "New Color Blind Mode - You can enable it in the settings, and it will add pattern to fluids & shapes.",
            "[[Balancing & Content]]",
            "Added separate extension for Fluid Miner, allowing to chain up to 5 additional extensions.",
            "Adjusted Shape Miner layout, reduced max extensions to 4 in exchange for improved patch arrangement.",
            "Removed full painter building",
            "Increased platform limit gained from research",
            "Removed excess HUB asteroids",
            "Fluids deposits now generate in different sizes/layouts on the map",
            "Changed purple (p) to magenta (m)",
            "[[Visuals & Graphics]]",
            "Adjusted fluid shaders & visuals",
            "Improved aliasing on glass shaders",
            "Improved overview mode (work in progress)",
            "Improved contrast of white vs uncolored shapes",
            "Added FPS limit setting",
            "[[User Interface]]",
            "Reworked toolbar & all icons, organize space platform layouts into different categories.",
            "Added more interface effects",
            "Added quit to desktop option",
            "Improved research screen usability",
            "Added names for research tasks",
            "Added visualization that shows coordinates in overview mode",
            "Added option to disable interface effects",
            "Added reset orientation button to shape viewer",
            "Added description for all settings & hotkeys",
            "Added animation when delivering a goal shape for the first time",
            "Now focusing on current milestone when opening the research interface for the first time",
            "Toggles in the research interface (Show locked, show completed) are now saved",
            "[[Bugfixes]]",
            "Fixed various belt launcher/catcher placement issues",
            "Fixed various UV issues on belt/splitter/merger meshes",
            "Fixed waypoints overlapping when having more than 6",
            "Fixed zoom hotkeys being inverted",
            "Fixed shape stacking logic with crystals (partially)",
            "Fixed placing button crashing the game"
        ]
    },
    {
        "Date": "March 21, 2024",
        "Version": "0.0.0-alpha18",
        "Entries": [
            "[[Savegame Compatibility]]",
            "Savegames from alpha 17 and below are NOT compatible due to major feature changes & refactorings",
            "[[Major Changes]]",
            "Reworked Fluid Packer & Unpacker",
            "Added train spawner platform, automatically spawns & owns up to 3 trains",
            "Trains now derail at the end of rails, making loops optional (but more efficient)",
            "Added 4th train color (white)",
            "Reworked fluid extractor platform, now works similar to the shape miner platform",
            "New Blueprint Library with folder support, quick slots & more",
            "Tunnels now support 3 layers instead of 1",
            "Big internal rendering refactor, please report any (new) visual issues",
            "Updated Unity to 2022.3.21f, hopefully solving a few system specific issues. Please report any (new) issues",
            "[[Balancing & Content]]",
            "Changed max tunnel range from 3 to 4, increased platform cost of tunnel entrance/exit from 1 to 3.",
            "Adjusted Shape Packer/Unpacker speeds & add more infos to their detail panel",
            "Changed most side goals to give chunk limit instead of blueprint points",
            "Changed map generation to be more optimal for chain miners",
            "Minor balancing adjustments",
            "Added Virtual Halves Destroyer",
            "Added Virtual Fluid Packer",
            "Added Virtual Fluid Unpacker",
            "Added Virtual Shape Packer",
            "Added Virtual Shape Unpacker",
            "Added Virtual Painter",
            "Added Virtual Stacker",
            "[[User Interface]]",
            "Allow pinning locked shapes again",
            "Add 'Buildings per full belt' statistic for all buildings",
            "Various improvements for user interface",
            "Add more statistics to building detail panel & increase visibility",
            "Adjusted shape resources visualization to show only one shape per patch",
            "Auto-pin next side-upgrade upon completion.",
            "[[Visuals]]",
            "Adjusted shape & fluid crate visuals (wip)",
            "Improved shape visuals & viewer",
            "Fluid shader animation speed now adjusts to fluid network speed",
            "Reduced outline strength",
            "[[Bugfixes]]",
            "Fixed shape counts not updating when Vortex is not in view",
            "Fixed full painter visual artifacts",
            "Fixed crash when clicking wire comparator",
            "Fixed color mixer not consuming fluid",
            "Fixed being able to build on rails",
            "Fixed inverted tunnel outputs",
            "Fixed blueprint json being prettified",
            "Fixed invalid assets in licenses",
            "Fixed visual issues on grid when placing trash on rotated platform",
            "Fixed splitters producing huge precision loss - but introduces visual item overlap issue again",
            "Fixed some (but by far not all) precision issues on low UPS"
        ]
    },
    {
        "Date": "March 7, 2024",
        "Version": "0.0.0-alpha17",
        "Entries": [
            "[[Savegame Compatibility]]",
            "Savegames from alpha 16 and below are NOT compatible due to major feature changes & refactorings.",
            "[[Major Changes]]",
            "New Fluid Simulation - It should be much more accurate & intuitive.",
            "Chain Miners - There is now only one 1x1 shape miner, but it can be chained with chain miners (inspired by shapez 1)",
            "New Wire Buildings - Button, Display, Virtual Rotator, Virtual Analyzer, Virtual Unstacker",
            "[[Balancing & Content]]",
            "Changed shape crate capacity to 180 (will be upgradeable later)",
            "Re-added larger island layouts as side upgrades",
            "Removed chunk limit upgrade, now only gained from milestones / side goals",
            "Re-balanced quantities for mid/late game side tasks",
            "Changed windmill shape and adjusted progression with new side goals",
            "Adjusted shape (un)packer dimensions from 1x2x1 to 2x2x1 (wip artwork)",
            "Adjusted crystal generator dimensions & mesh (wip)",
            "Updated crystal shaders (wip)",
            "Fluid tank now is directional, preventing back-flow",
            "Updated stacker mesh to indicator side-output better",
            "[[User Interface]]",
            "Reworked the research interface, should be much more intuitive now",
            "Added images for all research upgrades & milestones",
            "Lots of QoL improvements for the research interface & pinned shapes",
            "Lots of minor improvements to the interface",
            "Improved shape viewer shader",
            "[[Bugfixes]]",
            "Fixed logic gates not rendering",
            "Fixed pipes down not being placed correctly",
            "Merged back various fixes & changes from the demo",
            "Various fixes & improvements"
        ]
    },
    {
        "Date": "February 23, 2024",
        "Version": "0.0.0-alpha16.1",
        "Entries": [
            "[[Savegame Compatibility]]",
            "Savegames from alpha 16 are compatible.",
            "[[Content changes]]",
            "Removed old hyper belts, now only the new space belts + tunnels exist.",
            "[[Bugfixes]]",
            "Fixed HUB not updating slots after upgrading",
            "Fixed pipetting a space belt causing exception and savegame corruption",
            "Fixed multiple space belt issues"
        ]
    },
    {
        "Date": "February 22, 2024",
        "Version": "0.0.0-alpha16",
        "Entries": [
            "[[Savegame Compatibility]]",
            "Old savegames are not compatible. Blueprints are compatible, with some exceptions.",
            "[[Important Note]]",
            "This release introduces a <b>ton</b> of new features. Our main goal is gathering feedback from a game design perspective and figuring out if the mechanics are fun. The visuals are all placeholders, and expect some bugs / visual glitches.",
            "[[Major Changes]]",
            "New train system",
            "New space belt system, including splitters & mergers.",
            "New research system",
            "New pin pusher mechanics",
            "Platforms have less gap and thus are one tile bigger in every direction now",
            "New vortex platform layout"
        ]
    },
    {
        "Date": "December 21, 2023",
        "Version": "0.0.0-alpha15.2",
        "Entries": [
            "[[Savegame Compatibility]]",
            "Savegames from Alpha 14 and below are not compatible. Blueprints are compatible, with some exceptions.",
            "[[Major Changes]]",
            "Merged demo changes back to full version (see changes below) - some issues are still expected, and the progression is temporary.",
            "[[Game Design]]",
            "Ability to delete whole train tracks with 'X'",
            "Ability to limit train station loaders / unloaders to specific train colors.",
            "Added 'F' to swap the direction in which a train is spawned.",
            "Fixed trains unloading to the wrong side, also they now always prefer the left side.",
            "Trains now only slow down on matching train stations",
            "Fixed train stations not being cleared when using the 'Clear Contents' option"
        ]
    },
    {
        "Date": "December 12, 2023",
        "Version": "0.0.0-alpha15",
        "Entries": [
            "[[About this version]]",
            "This is the release candidate for the Steam Next Fest Demo in February 2024.",
            "[[Major Changes]]",
            "The game now uses physical keys, so the default hotkeys should be better on i.e. AZERTY layouts now, and rebinding should not be required anymore.",
            "[[Game Design]]",
            "Added Hotkey overview window showcasing the most important hotkeys",
            "Moved extractor to 6 instead of 3",
            "[[Visuals]]",
            "Improved Shape Visualization",
            "Cleaned up overview mode",
            "Added border lines to playingfield",
            "New LOD meshes for distant factories, making the transition less obvious",
            "Added more detailed meshes to the shape viewer",
            "Lots of mesh & LOD fixes",
            "Improved layer visibility toggle - buildings are now semi-transparent",
            "Improved HUB mesh & added LODs",
            "Reduced aliasing issues",
            "[[Development]]",
            "Reduced VRAM usage, making the game run more stable on lower-end GPUs",
            "Fixed lots of bug (see below)",
            "[[Localization]]",
            "Updated translations",
            "Fix text overflowing in research nodes",
            "Fix multiple localization issues",
            "[[Audio]]",
            "Added more interface sound effects",
            "Added new music tracks",
            "Added setting to mute audio when application is not focused",
            "[[Interface]]",
            "Tweaks & improvements to the main menu",
            "UI Updates, simplified toolbar UI",
            "Improved settings UI",
            "Improved dialogs UI",
            "Updated main menu",
            "Added more interesting loading messages",
            "Now showing self-intersection properly when placing a belt",
            "Updated knowledge panel with new screenshots",
            "[[Bugfixes]]",
            "Fixed multiple crashes",
            "Fixed language popup showing twice when changing language",
            "Fixed demo showing 93% research only once completed",
            "Fixed shadow artifacts on extreme quality on asteroids",
            "Fixed layer visibility toggle causing artifacts",
            "Fixed predictions flickering",
            "Fixed game crashing when savegame could not be saved",
            "Fixed multiple memory leaks",
            "Fixed research with same shapes not being automatically pinned when delivering",
            "Fixed undoing island blueprint placement not refunding blueprint cost",
            "Fixed IndexOutOfRange exception for some prediction special-cases",
            "Fixed 3 way merger not being properly placed in all situations",
            "Fixed belt catcher not being cleared properly",
            "Fixed artifacts on medium/bold text",
            "Fixed lots of visual issues & aliasing problems",
            "Fixed loading screen having aliasing issues",
            "Fixed blueprint conversion tooltip opening every time when starting a game",
            "Fixed compass not updating after pressing H",
            "Fixed cyclic factories breaking predictions",
            "Fixed game logfiles getting very large",
            "Fixed BlueprintEmptyException sometimes being thrown",
            "Fixed cutting a single building causing an exception",
            "Fixed various other issues"
        ]
    },
    {
        "Date": "November 16, 2023",
        "Version": "0.0.0-alpha14",
        "Entries": [
            "[[Savegame Compatibility]]",
            "Savegames from Alpha 12 and above are compatible (*)",
            "(*) Some errors can appear on load, that should go away once saved and loaded again.",
            "[[Major Changes]]",
            "Building sound effects & more! Everything in the game should now have proper sounds.",
            "Buildings now auto-rotate to fit belts.",
            "Splitters/mergers are not automatically placed when placing buildings",
            "Huge performance improvements esp. on low/minimum graphic settings, up to 200% better performance.",
            "[[Game Design]]",
            "Reworked Demo Tutorial to show less, but more effective hints.",
            "Predictions are now always shown on unconnected belt & building ends, as well as vortex inputs",
            "[[Visuals]]",
            "New HUB Vortex Visuals",
            "Changed rotators to be more distinct from processing buildings",
            "Shapes now also have LODs, also marking them more readable from distance",
            "Improved placement indicators for half destroyer, full cutter and halves swapper",
            "Added more LODs to everything",
            "[[Development]]",
            "Lots of performance improvements especially for lower-end setups, leading to up to 200% FPS improvements",
            "Added shader quality setting and added reduced shaders",
            "Improved LODs",
            "The game should run stable even on Intel UHD graphics now",
            "Vastly improved map generation performance, improving loading times & reducing stutter when moving the map fast",
            "[[Localization]]",
            "Fixed multiple issues in the English base translation",
            "Shortened tutorial texts",
            "[[Interface]]",
            "Tips are now shown more prominent for a few seconds",
            "Improved UI readability, general polishing",
            "Added feedback button in game",
            "Moved action buttons to the side panel to make them more visible",
            "Reduced/removed button timers",
            "Belt catapults now show a clear indicator that catapulting into the Vortex from other spots is not possible",
            "Allow right click to cancel placement even when over UI",
            "Improved placement conflict indicators for belts / buildings",
            "Cleaned up hotkey action hints",
            "Clicking on a research now scrolls to it in the research tree",
            "Added miner placement indicators",
            "Allow clicking compass to open shape viewer for current main goal",
            "Added tooltip for main goal, showing description of the next unlock",
            "Added dialog when finishing demo",
            "Belt launchers now delete belts in between",
            "[[Bugfixes]]",
            "Fixed shape asteroids and fluid clouds being culled while still visible",
            "Fixed error when opening Create Marker dialog",
            "Fixed 1x1 shape miner placement indicators being rotated wrong",
            "Fixed blueprint tutorial staying for too long",
            "Fix unlock sound being played during tutorial while no goal is visible",
            "Fix screen panning not being disabled in shape viewer",
            "Fixed splitter items overlapping (temporary fix for demo)",
            "Fixed settings disappearing when leaving them in main menu",
            "Fixed floor visibility tutorial showing every time floor visibility is toggled",
            "Fixed close buttons keeping hover effect forever",
            "Fixed left click on empty tile to deselect single building not working",
            "Fixed blueprints being able to be placed despite containing locked buildings",
            "Fixed placing a blueprint with invalid buildings placing only the platform but no buildings, yet consuming BP points",
            "Fixed camera panning occuring even when game is not focused",
            "Fixed various issues with predictions not working or causing exceptions",
            "Fixed being able to place belt catchers on hub",
            "Fixed platform grid shaking when moving camera",
            "Fixed tooltip for speed upgrades showing incorrect values when already unlocked",
            "Fixed incorrect numbers in building detail panel",
            "Fixed items clipping out of space tunnels",
            "Fixed first belt being backwards when dragging in the opposite direction",
            "Fixed dragging over hub causing artifacts",
            "Fixed belt placement not properly adjusting rotation while dragging",
            "Fixed various other issues"
        ]
    },
    {
        "Date": "November 16, 2023",
        "Version": "0.0.0-alpha13",
        "Entries": [
            "[[Savegame Compatibility]]",
            "Savegames from Alpha 12 are compatible (*), but can't be loaded into Alpha 11 once saved in Alpha 12.",
            "(*) If your savegame contains building on platform notches, this might cause issues when loading them, so try removing them in Alpha 11 before loading them into Alpha 12.",
            "[[Game Design]]",
            "Reworked tutorial, should be much more extensive & complete now",
            "Added videos for tutorial steps",
            "Added more resources in the starting area of the game",
            "Rotator now uses belt speed instead of cutting speed",
            "Allow configuring map generation seed during game creation",
            "Allow choosing game mode (demo / regular) during game creation",
            "Reworked building placement: Now much easier to replace buildings, SHIFT always overrides, lots of fine tuning & fixes for blueprint placement",
            "Only show relevant knowledge entries in the beginning and unlock them progressively",
            "Space belts are now only using tunnels for a distance of 3 or more",
            "Limit suggestions to 3 at most",
            "Disallow placing anything but belt launchers & train stations on notches",
            "[[Visual Updates]]",
            "Updated notch visuals",
            "Updated shape patch visuals",
            "Updated playingfield visuals",
            "Updated train station visualization",
            "Shadows are now rendered farther away, on high and extreme space stations now also have shadows, and on extreme shape asteroids & miners also have shadows",
            "Space stations in overview mode are now shown in 3D",
            "Added setting for Anisotropic Filtering",
            "Improved shadow quality",
            "Added LODs for miners & shape patches, further improving rendering performance",
            "Added indicators when placing belt ports",
            "[[User Interface / Experience]]",
            "Moved layer switch buttons to layer manager again",
            "Moved skill academy above toolbar to be more noticeable",
            "Show cost while placing space belts, and better show when running out of platform blocks",
            "Added continue button to main menu",
            "Show platform limit increase in research tooltips",
            "Allow deselecting building/island selection with right click",
            "Show warning on first game start when playing with integrated / low end GPU",
            "Swapped hotkeys for delete, the default is now X with Del being the secondary key",
            "Improved delete-area icon",
            "Show space belts also on extractor tab now",
            "Improved clarity/sharpness of mouse icons",
            "Reworked preload / splash screen, improved game startup time",
            "Last selected variant (i.e. rotator) is now stored and re-selected",
            "Do not show train visualizations when trains are not yet unlocked",
            "Hide main button panel when none are visible",
            "Show incompatible savegames in menu (i.e. outdated version, or Demo vs Full edition)",
            "Updated credits",
            "Updated game mode selection",
            "Added header for pinned shapes (Active Sidegoals)",
            "Added hint on blueprint library when there are no entries on how to save a blueprint to the library",
            "Flipped halves destroyer icon to align with the building functionality",
            "Disallow binding windows key",
            "Improved sharpness & Clarity of icons on lower resolutions",
            "Added hint in research unlock notification that you can find more information in the knowledge panel",
            "Made toggle buttons look less disabled",
            "Fixed invalid mouse sprites",
            "Added popup when changing language to require restart",
            "[[Development / Minor]]",
            "Limit game FPS to 300 when vsync is disabled to avoid GPU overheating",
            "Disabled OS screen saver",
            "Support for separate game modes in development builds, allowing to choose between regular & demo progression",
            "Added --reset-all-prefs command line flag",
            "Added support for loading custom translation files",
            "Improved --safe-mode command line flag,",
            "Added ability to load custom translation files with -custom-translation",
            "Game now errors when system does not meet minimum requirements (4GB RAM, 1GB VRAM,  Windows 10)",
            "[[Localization]]",
            "Fixed pin pusher description",
            "Fixed Next toolbar translation",
            "Fixed Platform Units translation",
            "Changed Planner to Operator",
            "Changed Cutters to Cutting",
            "Improved halves swapper description",
            "Changed 90 Rotator to 90 CW Rotator",
            "Fixed keybinding change dialog showing internal keybinding id",
            "Fixed invalid step count in knowledge panel for belt placement",
            "Improved cutter / halves destroyer description",
            "Added translation support and experimental machine translated localization",
            "[[Demo Specific]]",
            "Demo now always uses High UPS to prevent throughput issues (quickfix)",
            "Fixed some demo related content having WIP warnings",
            "Adjusted demo progression to include colored shapes",
            "Adjusted demo map generation to include a few asteroids with colored shapes",
            "Shorten demo progression to be roughly 2 hours now",
            "Added welcome dialog to main menu",
            "Added exit dialog with call to wishlist when quitting the game",
            "[[Bugfixes]]",
            "Fixed Exception: Fake input lane on belt path has item after update",
            "Fixed Exception: Serialization stored isFirst=true but indexInPath!=0",
            "Fixed skill academy Switch Variants hint shown for buildings that dont have variants",
            "Fixed tutorial panel visual artifacts",
            "Fixed being able to select space station blueprints without space stations unlocked",
            "Fixed tunnel visualization being offset",
            "Fixed blueprint currency tooltip having missing translations",
            "Fixed translucent background in debug console and research tree",
            "Fixed display of glyphs in foreign languages",
            "Fixed steam cloud not working",
            "Fixed unlock button for main goals in research tree only being partially clickable",
            "Fixed half destroyer blueprint looking off",
            "Fixed system info in settings overlapping",
            "Fixed halves swapper being mirrored wrong",
            "Fixed blueprint / chunk limit indicator blocking mouse clicks / interactions",
            "Fixed videos stuttering",
            "Fixed wiki images being overly blurry on windows",
            "Fixed jump to hub during belt/island placement crashing game",
            "Fixed videos not working on linux",
            "Fixed shape packer missing input filter, causing exception when delivering crates",
            "Fixed pin-only shapes breaking hub and shape viewer",
            "Fixed knowledge panel not updating keybindings when changed in the settings",
            "Fixed screenshot (F4) working in pause menu",
            "Fixed visual issue when placing 2 trashes diagonally",
            "Fixed blueprints not placing splitters/mergers if they overlapped a belt",
            "Fixed shadows not properly working for shape patches",
            "Fixed halves swapper being mirrored wrong",
            "Fixed videos not working on linux / steam deck"
        ]
    },
    {
        "Date": "November 2, 2023",
        "Version": "0.0.0-alpha12",
        "Entries": [
            "[[Savegame Compatibility]]",
            "Savegames from Alpha 11 are compatible, but the map generation changed, so you have to find new locations for your asteroid miner & fluid platforms.",
            "[[New Features]]",
            "New overview mode when zooming out very far, now showing islands, trains, shapes, rails, tunnels etc.",
            "Increased zoom limit to zoom out 4 times as much as before",
            "Map generation has been reworked entirely",
            "Shape previews: While placing buildings, the game now computes the outcome of operations in advance and shows it",
            "Mirrored full cutter",
            "[[Balancing & Gameplay]]",
            "Pins are now ignored when delivering research shapes to the vortex",
            "[[Visuals]]",
            "New visuals for shape asteroids, that are dynamically generated based on the contained shape",
            "New pin pusher visuals",
            "New belt launcher / catcher visuals",
            "New building & blueprint placement, selection & hover shaders that are more holographic and fit the space theme better",
            "Improved visuals for platform grid, also highlight grid while placing",
            "Added LODs for all demo-relevant buildings (full cutter, halves swapper, half cutter, rotator)",
            "[[User Interface]]",
            "Entire building + platform toolbar has been reworked to be much more consistent",
            "Building & Island selection is now much easier to deselect and not affected by undo/redo anymore",
            "Tooltips for research nodes now show the actual speed changes",
            "Less suggestions are now shown when you have lots of pins",
            "Contextual keybinding hints have been moved next to the toolbar, also show some 'standard' keybindings when nothing is selected",
            "Removed icons for keybindings since they were confusing -> Now text is always shown (i.e. 'SHIFT' instead of arrow icon)",
            "Now showing future milestones in research tree",
            "Compass now shows a west half indicator together with the current milestone shape",
            "(Re-)aligned HUD elements and reduced padding to the screen borders",
            "Streamlined panels -> Clickable panels now have the border, 'background' panels are just a flat panel (i.e. blueprint currency)",
            "Speed upgrades now just show as a notification when completed",
            "Decreased UI blur amount",
            "[[Localization]]",
            "Reworked & polished English translations",
            "[[Performance]]",
            "Introduced building details setting that should improve the performance a lot, especially on lower end setups",
            "Fluid deposits now have LODs and also reduced visuals on lower space background settings",
            "Steep camera angles are now restricted the more you zoom out, leading to much more consistent performance",
            "[[Onboarding]]",
            "Added knowledge panel entries for all major mechanics",
            "Added introductory screen when starting a new game",
            "[[Menu & Settings]]",
            "Reworked default keybindings",
            "Keybindings: Knowledge panel is now 'G'",
            "Keybindings: Pipette/Clone moved from 'G' to 'F'",
            "Keybindings: Toggle layers moved from 'L' to 'V'",
            "Keybindings: Can now also use 'X' to delete",
            "Keybindings: Center on Vortex is now 'H'",
            "Keybindings: Added ` and Shift + ` to switch between toolbars",
            "Keybindings: 'Space' now toggles between building & platform scope while saving your zoom level",
            "Added setting: Zoom Sensitivity",
            "Added setting: Invert Zoom",
            "Added setting: Mouse panning'",
            "Added setting: Invert Vertical Angle'",
            "Added setting: Confine cursor to window",
            "Added setting: Move camera with floors",
            "[[Minor]]",
            "Removed 'restrict zoom during placement' setting",
            "Allow replacing belt launchers with belts",
            "Minor train mode cleanup (but still VERY wip)",
            "Removed screenshot-without-ui feature since you can press F2 and then F4",
            "Added toggles instead of dropdowns for settings",
            "Moved research button to the top right of the screen",
            "Removed unused 'focus on selection' / 'convert path to blueprint' feature",
            "Allow replacing extractors with an extractor that is differently rotated",
            "Shape packers/unpackers now show shapes per crate in details",
            "Fluid packers/unpackers now show liters per crate in details",
            "Increased speed of main menu animations",
            "Allow saving selection with Ctrl + S already (to avoid having to press Ctrl + C and then Ctrl + S)",
            "Input / output indicators when placing now have different sizes depending on the layer> i.e. Stacker input on layer 2 has a smaller arrow while placing",
            "Hover effects for buildings now fades in / out",
            "Research unlock notification now has a short 5 second timer on the continue button to avoid accidentally skipping it",
            "Fixed 'jump to vortex' not actually jumping to the vortex & also it now resets the zoom level (but not the rotation anymore)",
            "Show CPU & GPU info in settings menu to make it easier to see if the game is running on an integrated GPU",
            "Decreased opacity of toolbar \"locked\" indicators to avoid looking like they could be clicked",
            "Removed fluid deposits visualization",
            "Development builds only: Allow configuring simulation mode (Force High UPS, Force Low UPS, Standard)",
            "[[Bugfixes]]",
            "Fixed preload / graphic settings screen showing on every game load",
            "Fixed settings not being saved when restarting game",
            "Fixed pipetting a mirrored stacker giving non-mirorred variant",
            "Fixed resolution / window options not being applied properly",
            "Fixed blueprint library not properly loading old blueprints",
            "Fixed 2-layer belt lifts not being properly flipped",
            "Fixed being unable to rotate islands after selecting a blueprint",
            "Fixed settings showing 500% instead of 0%",
            "Fixed belt catchers having overhanging shapes",
            "Fixed some simulation precision issues (but by far not all)",
            "Fixed building efficiency details showing fractional values / values > 100%",
            "Fixed being able to create a blueprint from a single building when not having unlocked blueprints",
            "Fixed 'flip inverse' not working",
            "Fixed hover animations being dependent on simulation speed and not disappearing when game is paused",
            "Fixed research nodes not being clickable and thus not unlockable",
            "Fixed being able to delete with right click even when over an UI panel",
            "Fixed hover animations appearing even when dialogs / screens where open",
            "Fixed completed research nodes not having tooltips, also show tooltips in suggestions & pinned research",
            "Fixed train station visualizations being too big",
            "Fixed island grid visualization being \"below\" the islands making it a bit confusing",
            "(Hopefully) fixed tutorial videos not loading on Linux / Steam Deck",
            "Fixed 'pending' selection looking like it would be above buildings",
            "Fixed stacker output preview being shown at wrong location",
            "[[Known new issues]]",
            "Unlock videos stutter sometimes"
        ]
    },
    {
        "Date": "October 19, 2023",
        "Version": "0.0.0-alpha11",
        "Entries": [
            "Lots of balancing adjustments to the research tree progression",
            "Updated layouts of shape & fluid miner patches",
            "Added a blueprint library (B) to store and load your blueprints",
            "The HUB was rotated by 90 degrees, making the initial camera position face north",
            "The starting map has been updated with more resources closer to the HUB",
            "Balancing: updated Cutter from 6 to 4 per full belt",
            "Balancing: updated Halves Swapper from 8 to 4 per full belt",
            "Added unlockable blueprint discounts to allow placing blueprints up to a set amount of buildings for free",
            "Mismatching belt connections now display indicators",
            "Adjusted platform limits in mid game",
            "Disabled island grid visualization by default, now shows when placing islands or manually activated",
            "HUB lock indicators are now always displayed",
            "Experimental hover indicators when hovering buildings / islands",
            "New fluid resource patch visuals",
            "Updated fluid and shape miner platform visuals (outer walls)",
            "Tunnel entrance elements are now centered",
            "Reworked the entire main menu and settings screens",
            "Added a drop-down functionality for most setting options",
            "Now asking for confirmation when leaving graphic settings with unsaved changes",
            "Controls settings now display keybindings as text + icons (if available)",
            "Keybindings now show SHIFT, ALT etc. as text instead of icons in settings",
            "Added option to disable tutorial",
            "Formatted in-game values to display larger numbers more compact (i.e. 595.000 -> 595k)",
            "Updated descriptions for all buildings and their variants",
            "Description for buildings are now shown when selected and are specific per variant",
            "Added W.I.P. hints for all non-completed buildings & features (i.e. Unstacker)",
            "Added unlockable fluid & shape packing sizes",
            "Fixed text issue on the main menu build details",
            "Fixed indicators when dragging belts backwards between platforms"
        ]
    },
    {
        "Date": "October 6, 2023",
        "Version": "0.0.0-alpha10.1",
        "Entries": [
            "Fixed halves swapper not working as intended",
            "Fixed full cutter visual issues",
            "Increased initial & research chunk limit again"
        ]
    },
    {
        "Date": "October 6, 2023",
        "Version": "0.0.0-alpha10",
        "Entries": [
            "Entirely reworked the in-game UI/UX & toolbars",
            "Added new tutorial steps",
            "Adjusted research goals and progression",
            "Replaced HUB size milestones with chunk limit unlocks (the HUB size unlocks are now side-goals)",
            "Vastly increased chunk limit, both initial and from upgrades",
            "Deleting buildings & belts now removes unused splitters & mergers automatically",
            "Added skill academy showing QoL tips like belt checkpoints",
            "Added new station platform layouts",
            "New Full Cutter design",
            "New Halves Swapper design & animations",
            "Balanced Halves Swapper: 4 instead of 3 per full belt",
            "Balanced Full Cutter: 4 instead of 6 per full belt",
            "Unlocking Blueprints now requires the first/second BP shape",
            "Unlock notifications now display videos of new buildings",
            "Updated placement grid and Layer UX visuals now also indicating which layer is selected",
            "New icons for toolbar, buildings (& partially UI)",
            "Cleaned up keybindings and removed unused ones",
            "Blueprinting a single building is now free",
            "Connecting two islands with belts now shows proper indicators",
            "Added LODs for Belt & Pipe stands",
            "Small updates to the Stacker design",
            "Added LODs to all space stations & platforms",
            "Moved editor specific code to its own folder",
            "Added basic support for special characters (Turkish, Russian, etc.)",
            "Update waypoint preview shape codes, also displaying Pins and Crystals as well now",
            "Added hint when blueprints overlap buildings to hold SHIFT to place anyways",
            "Auto-placement of catapult receivers on station notches even without catapult senders",
            "Minimized the pauses between the music tracks playing",
            "Adjusted pinned & suggested goals to display more goals, but still overlaps when many are added",
            "Fixed station meshes on minimum graphic settings",
            "Fixed see-through glitch when placing Trash near the hub entrance",
            "Fixed hub meshes on minimum and low graphic settings",
            "Fixed chunk mesh culling issue that made parts of the platform borders disappear",
            "Fixed issue where the game does not launch with an invalid changelog.json",
            "Fixed space stations z-fighting when blueprint is layered above existing station",
            "Fixed half cutter collapse & crystal animations",
            "Fixed mirrored stacker speed"
        ]
    },
    {
        "Date": "September 22, 2023",
        "Version": "0.0.0-alpha9",
        "Entries": [
            "Entirely new progression",
            "New research screen",
            "Basic tutorial concept for the first 2 levels",
            "New automatic tunnels placement, automatic hyper-belt creation",
            "Space stations now have LODs, leading to massive performance improvements",
            "Side goals are now automatically suggested (experimental)",
            "Additionally massive performance improvements for the space background",
            "Added Full Painter (esp. useful in combination with the Unstacker!)",
            "Updated Half Cutter visuals and renamed to 'Half Destroyer'",
            "Updated Shape visuals",
            "Updated Rotator visuals",
            "The shape viewer now supports entering any shape code to display it",
            "Delivering shapes of completed research after unlocking blueprints will now grant a small amount of blueprint points (experimental)",
            "Updated building and island toolbars for better readability (some features still missing)",
            "Building toolbar number keys also cycles through variants when clicked again",
            "Updated research unlock screen to display new tools (placeholder images)",
            "Added interface settings to control mouse and keyboard movement sensitivity",
            "Fixed blueprint placement not working after switching layers",
            "Fixed fix building rotation in island blueprint preview",
            "Fixed building blueprint cost",
            "Fixed issue were space station blueprints cannot be placed despite enough BP currency",
            "Removed ability to place belt checkpoints outside of islands",
            "Added decimal to the blueprint points to allow smaller fractions of currency",
            "Fixed HUB placement grid missing on Layer 1 and 2",
            "Fixed space bar not centering the camera view at the Hub"
        ]
    },
    {
        "Date": "September 08, 2023",
        "Version": "0.0.0-alpha8.0",
        "Entries": [
            "New procedural map generation (visuals are temporary)",
            "Added blueprinting functionality to space stations to allow copying, cutting, pasting, and rotating one or multiple islands.",
            "New temporary visuals for the overview mode of shape & fluid patches",
            "New concept for the 1x1 shape miner platform, for now unlocked at the same time as the 2x1 miner",
            "Updated Stacker design with input/output lanes to the side (Mirror with 'F')",
            "Added HUD details on station contents when selecting a space station platform",
            "Trains are now deleted when rails below are deleted",
            "Train line & train station visualization is now always active in rail placement mode",
            "Trains now accelerate on long distance tracks (but they decelerate at turns & train stations)",
            "Shape crate size changed from 50 to 250",
            "Trains no longer collide with other trains of the same color, instead they wait for the next rail segment to be cleared",
            "Trains can no longer be placed on a rail with a different color",
            "Trains now drive on the 'right' side of the rail, thus making them overlap much less on monorails",
            "Fluid crates now have a capacity of 1,000L (compared to 45L before)",
            "Fluid tanks capacity is now 10,000L (previously 2,000L)",
            "Fluid packer & unpacker have much bigger buffers now (2,000L)",
            "Renamed fluid filler/drainer to fluid packer/unpacker to be more consistent",
            "Merged fluid unpacker and packer into a single building with multiple variants (same as shape packer)",
            "New shape design with updated outline colors and adjusted height of the different shape layers",
            "Shape Packer now accepts shapes delivered in any rotation",
            "Fixed cloud build issues",
            "Fixed undo/redo for islands sometimes not working",
            "Fixed the hub beam height to exceed screen area",
            "Fixed flickering when using the pipette tool (G) in empty space",
            "Fixed issue with rotator building being placed down multiple times",
            "Fixed T-merger mirroring issue using F key"
        ]
    },
    {
        "Date": "August 11, 2023",
        "Version": "0.0.0-alpha7.4",
        "Entries": [
            "Added experimental 2-layer Belt Lifts",
            "Added experimental Unstacker (Splits the topmost layer from the rest of the shape)",
            "Crystals now are created from fluid colors, and thus there are now different crystal types.",
            "The default camera now faces north when starting a new game",
            "Added LOD meshes for one of each space station module types",
            "Added internal support for Steam SDK & API",
            "Added LODs & polishing for Belts, Splitter, Mergers, and Belt-lifts",
            "Updated Space Station Notches with a new visual concept",
            "Updated Topmost Painter visuals",
            "Updated serialization to only store super chunks that have islands inside to reduce size and prevent lags during saving.",
            "Shadows now fade out with distance to be consistent with higher LODs missing shadows. Distance will be configurable later.",
            "Added support for LOD2 & LOD3 for glass meshes on buildings",
            "Refactored island layouts to allow negative chunk coordinates",
            "Lowered the amount of background asteroids",
            "Fixed 3-Way Merger auto-placement when connecting belts",
            "Fixed Station Miner bottom graphics disappearing when zooming in"
        ]
    },
    {
        "Date": "July 28, 2023",
        "Version": "0.0.0-alpha7.3",
        "Entries": [
            "Allow loading old blueprints from previous versions",
            "Added function for pipetting islands with G-key",
            "Added key to create screenshot without or with UI (F4 / Shift + F4)",
            "Added language selection on game launch (but there is only one for now)",
            "Added support for changing the game language in Settings",
            "Added an unlock dialog when unlocking research upgrades or milestones",
            "All belts, splitters, mergers and lifts have 4 LODs now",
            "Updated Unity to 2022.3.5f1 - Should fix some issues & improve performance"
        ]
    },
    {
        "Date": "July 16, 2023",
        "Version": "0.0.0-alpha7.2",
        "Entries": [
            "Added visualizations! 10 different ways to inspect your factory",
            "Trains can now be loaded from both sides! When there are stations on both sides, they prefer the right station (multi-station loading not yet possible).",
            "Trains no longer stop on islands when there are no train stations",
            "Reworked the entire overview mode",
            "Reworked the island placement - islands now have tabs & toolbars",
            "You can now select & delete multiple islands",
            "Support for both island & building selections at the same time"
        ]
    },
    {
        "Date": "July 14, 2023",
        "Version": "0.0.0-alpha7.1",
        "Entries": [
            "Redesigned overview mode with various indicators (work in progress)",
            "Notches are now centered",
            "Removed storage building",
            "Shape packer/unpacker are now one building",
            "Removed Barrel Producer Building",
            "First Train mechanics (work in progress)",
            "Fluid Barrels are now free and can be transported via trains",
            "Adjusted & Polished Materials for Space Station, Buildings, Playingfield, and Global Lighting",
            "Change PlayerBlueprints to be global and not per-player (Breaks old savegames)",
            "Side goals and upgrades are pinned automatically when the first shape is delivered",
            "Store research progress globally for savegame instead of per player (Breaks old savegames)",
            "Reworked HUD panel logic to simplify the creation of new panels",
            "Added privacy policy link in preload",
            "Fixed dragging belts fast not placing the belt",
            "Added licenses state to main menu (WIP)",
            "Improved building toolbar",
            "Hotkey for island management changed from F to H",
            "Graphic Settings now has Confirm screen with timer before applying changes.",
            "Crash Screen has been reworked to allow copying the error code and also links to Discord.",
            "Overall UI & HUD improvements, able to select building toolbar when not in overview mode",
            "Fixed console error when clearing shape extractors",
            "Removed controller support for now (since it was not working properly anyways)",
            "Placement layer 2 on HUB fixed",
            "Fixed cornered belt lift shapes rotating in place"
        ]
    },
    {
        "Date": "July 8, 2023",
        "Version": "0.0.0-alpha7.0",
        "Entries": [
            "Notches are now centered and on all sides (some layouts still need adjustments)",
            "When unlocking islands, directly start with an 1x1 and a 2x1 layout now",
            "Fluid packer now 'auto-spawns', barrels, thus you don't need to produce them anymore",
            "Barrels can now be loaded in trains",
            "Storage & Hydraulic press have been removed",
            "Building toolbar now shows variants directly above the building",
            "Minor UI improvements",
            "Combined ShapePacker and Unpacker into single building",
            "First take on showing open source licenses in the main menu",
            "Fixed fast dragging not placing belts"
        ]
    },
    {
        "Date": "June 30, 2023",
        "Version": "0.0.0-alpha6.2",
        "Entries": [
            "This build has a few trailer specific adjustments that will be removed in the next build again",
            "Improved overview mode",
            "Improved tunnel simulation again, they should now run at full speed",
            "Improved rendering performance for large factories (still WIP though)",
            "When placing belts / pipes, E and Q hotkeys are now shown",
            "Added shader quality setting",
            "New rails material",
            "Adjusted AO settings",
            "Material & Lighting improvements",
            "Color-grading & Post-processing improvements",
            "Support for generic amount of layers (only for mods)",
            "Fixed placement grid being displayed on tunnels",
            "Fixed a few typos",
            "Fixed lighting in main menu",
            "Fixed playingfield flickering",
            "Fixed HUB glowing white in builds",
            "Fixed invalid normal generation",
            "Fixed Shapes flickering the first time a new shape is created"
        ]
    },
    {
        "Date": "June 25, 2023",
        "Version": "0.0.0-alpha6.1",
        "Entries": [
            "Actual progression! Please try the game without cheats now, and let us know what you think!",
            "Updated UI/UX (buildings, islands, blueprints etc.)",
            "LOTS of updated visuals",
            "EXPERIMENTAL: Shape packer & unpacker (works! but work in progress)",
            "Allow using Ctrl + X to cut/move selection",
            "Indicators on HUB whether you are delivering wrong shapes",
            "HUB now glows depending on how many shapes you feed in",
            "Tunnels now have updated visuals & work more precise (but not 100%)",
            "Show rails & tunnels in overview mode",
            "New research UI in the top left showing the current milestone",
            "Fixed lots of full cutter issues",
            "Fixed lots of half cutter issues",
            "Fixed lots of halves swapper issues (i.e. errors when producing empty shape and many more)",
            "Fixed fluid filler/drainer and hydraulic press speed",
            "Lots of visual improvements",
            "Improved research tree ui, also better show main goal",
            "Improved rail placement, allow deleting rails",
            "Pipes now have more accurate fluid meshes",
            "Updated many building models",
            "Allow using pipette over shape patch / fluid patch to select extractor / pump",
            "New HUB visuals",
            "Rails & Trains are now stored in the savegame",
            "Avoid zooming in too close when centering on hub",
            "New Shape & Fluid resource materials",
            "Allow opening shape viewer for main milestone",
            "Updated train model",
            "Lots of art changes again",
            "Fixed various spelling issues",
            "[Temporary] Increased amount of background decorations for trailer",
            "Added shader quality setting",
            "Performance improvements for large factories (still WIP)",
            "EXPERIMENTAL: Train station loader & unloader building (Do NOT work yet)"
        ]
    },
    {
        "Date": "June 2, 2023",
        "Version": "0.0.0-alpha5",
        "Entries": [
            "New pipe & fluid visuals",
            "Newly imported savegames now appear at the top of the list",
            "Added close button to research tree",
            "Added bigger islands for the lategame",
            "Updated fluid extractor island",
            "Updated visuals, new pipe + fluid shaders",
            "Fixed permanent saving when disabling autosave",
            "Fixed extractor entity not producing while not in view after loading savegame",
            "Fixed hub size 3 coming before hub size 2",
            "Fixed most of the fluid related buildings being red"
        ]
    },
    {
        "Date": "May 30, 2023",
        "Version": "0.0.0-alpha4",
        "Entries": [
            "Tunnels now work, but are very experimental and most likely have a lot of bugs",
            "Basic train mechanics (but they can't be loaded / unloaded yet, but you can spawn a train with 'K' on a rail)",
            "Buildings can now get faster via research",
            "New building: Halves Swapper",
            "Buildings now show their speed and other stats in the details panel, also during placement",
            "The HUB can now grow via research",
            "New overview mode when zooming out",
            "The HUB now indicates whether shapes are accepted or not",
            "Rotators now better show their orientation while placing, and can be replaced with a different variant",
            "Lots of visual improvements & model changes (some are still outdated)",
            "Allow clearing shapes & fluids in selection with hotkey (currently 'I')",
            "Blueprints can now be mirrored, as long as all contained buildings have a mirrored variant",
            "Trash + Storage has been reworked to create a 'void' now, also can no longer be placed on or next to resource patches and/or island borders",
            "Reworked the graphic style of the game, still very work in progress",
            "Islands now show with little arrows on the playingfield where shapes would arrive, to make it easier to plan",
            "Notches now indicate when they are used",
            "Better placement helpers for catapults",
            "Building like the rotator or cutter now have indicators while placing",
            "Improved belt placement when placing a checkpoint and directly after moving a layer up/down",
            "You can now replace rotators without having to delete the old variant first",
            "You can now rotate shapes in any direction in the shape viewer",
            "Catapults now have physics, shapes collide with buildings on their trajectory",
            "Better catapult placement helpers (still unfinished, but now at least with correct ranges)",
            "Improved readability of shift icon",
            "Allow rotating shapes in the shape viewer",
            "Allow deleting corrupt / outdated savegames from the menu",
            "Switched to vulkan as a default renderer to fix various issues on Windows / Linux.",
            "Fixed not being able to assign modifier keys to keybindings",
            "Research nodes now show the tier in their name",
            "Locked island layouts now show the required research",
            "Added hotkey to toggle variants (tab / shift + tab)",
            "Added hotkey (TAB) to switch variants",
            "Added more music tracks, tracks are now randomized",
            "Added more VSync options",
            "Added cheat commands to set time scale",
            "Fixed shape viewer materials",
            "Fixed creating a blueprint from a path causing an error when there were overlapping belts",
            "Fixed long belts being very slow to place",
            "Fixed background decoration asteroids disappearing while in view",
            "Fixed outlines not being affected by transparency",
            "Fixed shapes not counting towards research goals, and added more checks to prevent similar issues in the future",
            "Fixed catapults accepting shapes from any direction",
            "Fixed playtime advancing in pause menu",
            "Fixed wrong rotation of compass",
            "Fixed enabling cheats also flagging future savegames"
        ]
    },
    {
        "Date": "April 16, 2023",
        "Version": "0.0.0-alpha3",
        "Entries": [
            "Blueprints now have a cost, you can get blueprint currency from various shapes",
            "Blueprints are now automatically copied to your clipboard, so you can share them! Use Ctrl + V to paste a blueprint from your clipboard.",
            "There is now a maximum limit to island chunks, which can be increased via research",
            "First take on the island overview (when placing/moving islands)",
            "Improved building stands generation to reduce visual clutter",
            "Improved camera direction indicator",
            "Improved rendering performance",
            "Refactored large parts of the simulation, so expect lots of bugs - please report them!",
            "Reduced most of the lag spikes, especially when rotating the camera",
            "More debug checks - please report all console errors you see in the discord!",
            "Allow trashing shapes by catapulting past the corner of the island (animation is WIP)",
            "Cheats are now hidden in the console, and can be enabled with cheats.enable",
            "ESC now also toggles pause menu",
            "Better autocomplete in debug console",
            "New game logo / icon",
            "Fixed throughput being displayed as per second when per minute was correct.",
            "Fixed some memory leaks",
            "Fixed old savegame backups not being cleaned up",
            "Fixed long key names (like from controllers) breaking tooltips",
            "Fixed console error when entering invalid values into sandbox fluid producer",
            "Fixed glitch with scroll bars",
            "Fixed missing icons"
        ]
    },
    {
        "Date": "April 1, 2023",
        "Version": "0.0.0-alpha2",
        "Entries": [
            "Improved automatic belt/pipe placement when going layer up/down",
            "Minor changes to resource generation (loading existing savegames will cause asteroids to move)",
            "Prevented being able to produce barrels from pin only shapes (P-------) which would allow infinite barrel production",
            "Fixed extractors showing 200% efficiency",
            "Fixed efficiency % word-break in building details panel",
            "Fixed letter spacing on labels",
            "Fixed fluid/item producer translations",
            "Fixed scroll wheel / keybindings working when window is not focused / mouse is not over window",
            "Fixed graphical glitch when pressing 'B' while placing conveyors / pipes and then placing them.",
            "Fixed error when going 2 layers up on the same tile on belts/pipes.",
            "Fixed graphical glitches when changing fluid producer contents",
            "Fixed analytics/GeoIP error when launching game",
            "Added --safemode command line option to start the game in windowed mode",
            "Added debug.sysinfo console command",
            "Stability improvements",
            "Updated engine version"
        ]
    },
    {
        "Date": "March 29, 2023",
        "Version": "0.0.0-alpha1",
        "Entries": [
            "Introduce Changelog",
            "Add preload sequence, allowing to select graphics quality and opt-in/out into analytics",
            "Add graphics presets",
            "Fix pipette on stacker causing error",
            "Allow changing screen resolution",
            "Improve space background"
        ]
    }
]